#include <iostream>
using namespace std;

/*
Программа: О себе
Автор: Новиков Владислав Борисович
Дата: 16.10.2026
Группа: ИСПкр-252
*/

int main() {
	system("chcp 65001 > nul");

	//Заголовок
	cout << "================================" << endl;
	cout << "     Информация о студенте" << endl;
	cout << "================================" << endl;

	//Личные данные
	cout << endl;
	cout << "Имя: Новиков Владислав Борисович" << endl;
	cout << "Группа: ИСПкр-252" << endl;
	cout << "Возраст: 17" << endl;

	//Увлечения
	cout << endl;
	cout << "Мои увлечения:" << endl;
	cout << " 1. Игра в шахматы" << endl;
	cout << " 2. Игра в шашки" << endl;
	cout << " 3. Маппинг в Minecraft" << endl;

	//Мотивация
	cout << endl;
	cout << "Почему я изучаю программирование:" << endl;
	cout << "Для создания собственного приложения" << endl;

	cout << endl;
	cout << "================================" << endl;

	return 0;
}