#include <iostream>

int main() {
    cout << "Hello";
    return 0;
}

// 1 экс.: программа не запустится, появятся ошибки: "cout": не является членом "std" и cout: необъявленный идентификатор
// 2 экс.: компиляция программы проходит успешно, но запуск невозможен, т.к. на этапе компоновки возникает ошибка
// 3 экс.: программа запускается и работает без ошибок, т.к. у "main" при отсутствии "return" компилятор автоматически подставляет в конец значение "return 0;"
// 4 экс.: ошибка: cout: необъявленный идентификатор. Способы решения: 1) добавить "std::" перед "cout". 2) добавить строку "using namespace std;" перед main